![01](01.png)

https://data.seoul.go.kr/
### 서울시 청소년 정신건강 통계

In [4]:
import pandas as pd

In [5]:
dates = pd.date_range('20190301', periods = 6)

In [6]:
dates

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
import numpy as np

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = ['A', 'B', 'C', 'D'])

In [9]:
df

                   A         B         C         D
2019-03-01  0.946620  0.587796 -1.437054  1.025153
2019-03-02 -0.981618 -1.497958 -0.988098 -0.107907
2019-03-03  0.597480  1.064661  0.682669 -1.099159
2019-03-04 -0.115275  2.139254  0.218520  0.115755
2019-03-05 -0.936642 -0.288862  1.128392  0.732115
2019-03-06 -0.067439  0.397656 -0.203450  0.736225

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.index

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.values

array([[ 0.94661955,  0.58779598, -1.43705412,  1.02515301],
       [-0.98161758, -1.49795766, -0.98809812, -0.10790714],
       [ 0.59747953,  1.06466147,  0.68266887, -1.09915883],
       [-0.11527463,  2.13925351,  0.21851972,  0.11575501],
       [-0.93664194, -0.28886209,  1.128392  ,  0.73211503],
       [-0.06743853,  0.39765633, -0.20344976,  0.73622542]])

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.092812  0.400425 -0.099837  0.233697
std    0.782316  1.231164  0.980827  0.779034
min   -0.981618 -1.497958 -1.437054 -1.099159
25%   -0.731300 -0.117232 -0.791936 -0.051992
50%   -0.091357  0.492726  0.007535  0.423935
75%    0.431250  0.945445  0.566632  0.735198
max    0.946620  2.139254  1.128392  1.025153

In [16]:
df.sort_values(by = 'A')

                   A         B         C         D
2019-03-02 -0.981618 -1.497958 -0.988098 -0.107907
2019-03-05 -0.936642 -0.288862  1.128392  0.732115
2019-03-04 -0.115275  2.139254  0.218520  0.115755
2019-03-06 -0.067439  0.397656 -0.203450  0.736225
2019-03-03  0.597480  1.064661  0.682669 -1.099159
2019-03-01  0.946620  0.587796 -1.437054  1.025153

In [17]:
df.sort_values(by = 'A', ascending = False)

                   A         B         C         D
2019-03-01  0.946620  0.587796 -1.437054  1.025153
2019-03-03  0.597480  1.064661  0.682669 -1.099159
2019-03-06 -0.067439  0.397656 -0.203450  0.736225
2019-03-04 -0.115275  2.139254  0.218520  0.115755
2019-03-05 -0.936642 -0.288862  1.128392  0.732115
2019-03-02 -0.981618 -1.497958 -0.988098 -0.107907

In [18]:
df['A']

2019-03-01    0.946620
2019-03-02   -0.981618
2019-03-03    0.597480
2019-03-04   -0.115275
2019-03-05   -0.936642
2019-03-06   -0.067439
Freq: D, Name: A, dtype: float64

In [19]:
type(df['A'])

pandas.core.series.Series

In [20]:
df[0:3]

                   A         B         C         D
2019-03-01  0.946620  0.587796 -1.437054  1.025153
2019-03-02 -0.981618 -1.497958 -0.988098 -0.107907
2019-03-03  0.597480  1.064661  0.682669 -1.099159

In [21]:
df.loc['2019-03-01']

A    0.946620
B    0.587796
C   -1.437054
D    1.025153
Name: 2019-03-01 00:00:00, dtype: float64

In [22]:
df.loc['2019-03-01', 'A']

0.9466195510860197

In [23]:
df.loc['2019-03-01', ['A','B']]

A    0.946620
B    0.587796
Name: 2019-03-01 00:00:00, dtype: float64

In [24]:
df.loc['2019-03-01' : '2019-03-02', ['A','B']]

                   A         B
2019-03-01  0.946620  0.587796
2019-03-02 -0.981618 -1.497958

In [25]:
df.loc[:, ['A','B']]

                   A         B
2019-03-01  0.946620  0.587796
2019-03-02 -0.981618 -1.497958
2019-03-03  0.597480  1.064661
2019-03-04 -0.115275  2.139254
2019-03-05 -0.936642 -0.288862
2019-03-06 -0.067439  0.397656

In [26]:
df.iloc[0:2]

                   A         B         C         D
2019-03-01  0.946620  0.587796 -1.437054  1.025153
2019-03-02 -0.981618 -1.497958 -0.988098 -0.107907

In [30]:
df.iloc[0:2,0:2]

                   A         B
2019-03-01  0.946620  0.587796
2019-03-02 -0.981618 -1.497958

In [31]:
df.iloc[[0,1,2],0:2]

                   A         B
2019-03-01  0.946620  0.587796
2019-03-02 -0.981618 -1.497958
2019-03-03  0.597480  1.064661

In [32]:
df['A'] > 0

2019-03-01     True
2019-03-02    False
2019-03-03     True
2019-03-04    False
2019-03-05    False
2019-03-06    False
Freq: D, Name: A, dtype: bool

In [33]:
df[df['A'] > 0]

                  A         B         C         D
2019-03-01  0.94662  0.587796 -1.437054  1.025153
2019-03-03  0.59748  1.064661  0.682669 -1.099159

In [34]:
df > 0

                A      B      C      D
2019-03-01   True   True  False   True
2019-03-02  False  False  False  False
2019-03-03   True   True   True  False
2019-03-04  False   True   True   True
2019-03-05  False  False   True   True
2019-03-06  False   True  False   True

In [35]:
df[df > 0]

                  A         B         C         D
2019-03-01  0.94662  0.587796       NaN  1.025153
2019-03-02      NaN       NaN       NaN       NaN
2019-03-03  0.59748  1.064661  0.682669       NaN
2019-03-04      NaN  2.139254  0.218520  0.115755
2019-03-05      NaN       NaN  1.128392  0.732115
2019-03-06      NaN  0.397656       NaN  0.736225

In [37]:
df2 = pd.DataFrame(df, columns = ['A', 'C', 'D', 'B'])
df2

                   A         C         D         B
2019-03-01  0.946620 -1.437054  1.025153  0.587796
2019-03-02 -0.981618 -0.988098 -0.107907 -1.497958
2019-03-03  0.597480  0.682669 -1.099159  1.064661
2019-03-04 -0.115275  0.218520  0.115755  2.139254
2019-03-05 -0.936642  1.128392  0.732115 -0.288862
2019-03-06 -0.067439 -0.203450  0.736225  0.397656

In [38]:
df['E'] = np.nan
df

                   A         B         C         D   E
2019-03-01  0.946620  0.587796 -1.437054  1.025153 NaN
2019-03-02 -0.981618 -1.497958 -0.988098 -0.107907 NaN
2019-03-03  0.597480  1.064661  0.682669 -1.099159 NaN
2019-03-04 -0.115275  2.139254  0.218520  0.115755 NaN
2019-03-05 -0.936642 -0.288862  1.128392  0.732115 NaN
2019-03-06 -0.067439  0.397656 -0.203450  0.736225 NaN

In [39]:
df.loc['2019-03-02', 'E'] = 2
df

                   A         B         C         D    E
2019-03-01  0.946620  0.587796 -1.437054  1.025153  NaN
2019-03-02 -0.981618 -1.497958 -0.988098 -0.107907  2.0
2019-03-03  0.597480  1.064661  0.682669 -1.099159  NaN
2019-03-04 -0.115275  2.139254  0.218520  0.115755  NaN
2019-03-05 -0.936642 -0.288862  1.128392  0.732115  NaN
2019-03-06 -0.067439  0.397656 -0.203450  0.736225  NaN

In [40]:
df['F'] = df['A'] + df['B']
df

                   A         B         C         D    E         F
2019-03-01  0.946620  0.587796 -1.437054  1.025153  NaN  1.534416
2019-03-02 -0.981618 -1.497958 -0.988098 -0.107907  2.0 -2.479575
2019-03-03  0.597480  1.064661  0.682669 -1.099159  NaN  1.662141
2019-03-04 -0.115275  2.139254  0.218520  0.115755  NaN  2.023979
2019-03-05 -0.936642 -0.288862  1.128392  0.732115  NaN -1.225504
2019-03-06 -0.067439  0.397656 -0.203450  0.736225  NaN  0.330218

In [41]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\user\anaconda3\lib\site-packages (2.0.1)

In [42]:
pd.read_excel("./data/teen.xls")

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2020,구분,35.1,29.8,40.8,25.4,21.2,29.9,11.2,8.8,13.8

In [43]:
pd.read_excel("./data/teen.xls", header = 1)

     기간 구분     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  2020  구분  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [44]:
pd.read_excel("./data/teen.xls", header = 1, usecols = "C:K")

     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [48]:
col_names = ['스트레스', '스트레스남학생', '스트레스여학생', '우울감경험율', '우울남학생', '우울여학생', '자살생각율', '자살남학생', '자살여학생']
pd.read_excel("./data/teen.xls", header = 1, usecols = "C:K", names = col_names)

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [49]:
raw_data = pd.read_excel("./data/teen.xls", header = 1, usecols = "C:K", names = col_names)
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [50]:
raw_data.loc[1] = 100 - raw_data.loc[0]
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8
1  64.9     70.2     59.2    74.6   78.8   70.1   88.8   91.2   86.2